#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.assume_role: Reading...
aws_eip.eip_02: Refreshing state... [id=eipalloc-0c92fb58663c27eee]
aws_eip.eip_01: Refreshing state... [id=eipalloc-0a7d640505a1494fe]
aws_iam_role.iam_role_eks_node_group: Refreshing state... [id=earth-dev-eks-node-group-role]
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3552664922]
aws_vpc.vpc: Refreshing state... [id=vpc-0b814f517378d9e50]
aws_iam_role.iam_role_eks: Refreshing state... [id=earth-dev-eks-cluster-role]
aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=earth-dev-eks-cluster-role-20231013102148265800000001]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=earth-dev-eks-cluster-role-20231013102148267300000002]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=earth-dev-eks-node-group-role-20231013102148324200000003]
aws_iam_role_policy.iam_role_policy_s3: Refreshing state... [id=earth-dev-eks-node-group-role:s3_policy]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=earth-dev-eks-node-group-role-20231013102148327800000004]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=earth-dev-eks-node-group-role-20231013102148351700000005]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-09bb9ecb8e99c943c]
aws_subnet.public_subnet_01: Refreshing state... [id=subnet-010f9b4cf6ad6fe6e]
aws_subnet.public_subnet_02: Refreshing state... [id=subnet-06b8a19911032612c]
aws_subnet.private_subnet_02: Refreshing state... [id=subnet-0e0bfc12567614d8e]
aws_security_group.cluster_sg: Refreshing state... [id=sg-0307be46f30a8dc3a]
aws_subnet.private_subnet_01: Refreshing state... [id=subnet-07a3db8c6ab820468]
aws_route_table.public_route_table: Refreshing state... [id=rtb-06538b024c232dcdc]
aws_nat_gateway.nat_gateway_02: Refreshing state... [id=nat-0cc8cb718755de34d]
aws_nat_gateway.nat_gateway_01: Refreshing state... [id=nat-06a136a9cfcb714eb]
aws_launch_template.app_node: Refreshing state... [id=lt-0ede6f27086573424]
aws_eks_cluster.eks_cluster: Refreshing state... [id=earth-dev]
aws_route_table_association.route_table_association_p01: Refreshing state... [id=rtbassoc-0abd2216504ab1442]
aws_route_table_association.route_table_association_p02: Refreshing state... [id=rtbassoc-06025dd5cb3bbb2ba]
aws_route_table.private_route_table_02: Refreshing state... [id=rtb-04da4ff5092c9d8a9]
aws_route_table.private_route_table_01: Refreshing state... [id=rtb-04652d2c6848c0510]
aws_route_table_association.route_table_association_i02: Refreshing state... [id=rtbassoc-06832d4c07af4df29]
aws_route_table_association.route_table_association_i01: Refreshing state... [id=rtbassoc-0c256827380cda455]
aws_eks_identity_provider_config.oidc: Refreshing state... [id=earth-dev:earth-dev]
aws_eks_addon.kube-proxy: Refreshing state... [id=earth-dev:kube-proxy]
aws_eks_addon.vpc-cni: Refreshing state... [id=earth-dev:vpc-cni]
aws_eks_node_group.app_node_group: Refreshing state... [id=earth-dev:app-node-group]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name           = "coredns"
      + addon_version        = "v1.10.1-eksbuild.4"
      + arn                  = (known after apply)
      + cluster_name         = "earth-dev"
      + configuration_values = jsonencode(
            {
              + replicaCount = 2
              + resources    = {
                  + limits   = {
                      + memory = "170Mi"
                    }
                  + requests = {
                      + cpu    = "100m"
                      + memory = "70Mi"
                    }
                }
            }
        )
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "earth-dev"
        }
    }

  # aws_eks_addon.kube-proxy is tainted, so must be replaced
-/+ resource "aws_eks_addon" "kube-proxy" {
      ~ arn                  = "arn:aws:eks:ap-northeast-2:318374019075:addon/earth-dev/kube-proxy/16c5944a-e50f-95be-3a22-426c6c3fa0f8" -> (known after apply)
      + configuration_values = (known after apply)
      ~ created_at           = "2023-10-13T10:29:47Z" -> (known after apply)
      ~ id                   = "earth-dev:kube-proxy" -> (known after apply)
      ~ modified_at          = "2023-10-13T10:44:53Z" -> (known after apply)
      - tags                 = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_eks_node_group.app_node_group is tainted, so must be replaced
-/+ resource "aws_eks_node_group" "app_node_group" {
      ~ ami_type               = "CUSTOM" -> (known after apply)
      ~ arn                    = "arn:aws:eks:ap-northeast-2:318374019075:nodegroup/earth-dev/app-node-group/5ac5944a-e50c-f6a4-e9ac-8b9ce5c167f5" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "earth-dev:app-node-group" -> (known after apply)
      ~ instance_types         = [] -> (known after apply)
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "ami-09af799f87c7601fa" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-app-node-group-5ac5944a-e50c-f6a4-e9ac-8b9ce5c167f5"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
      - tags                   = {} -> null
      + version                = (known after apply)
        # (5 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0ede6f27086573424"
          ~ name    = "app_node_launch_template" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ update_config {
          - max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jonghak-dev, Action: `pull_request`, Workflow: `Terraform apply`*